// pages/rules/rules.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        dialogue: [
            {student: '学生：座位如何预约?',
                teacher: '老师：可以在微信小程序内栏目搜索小程序，点击进入并授权，就可以看到座位预约模块，如需预约首先需要进行登录，登录的账号为移动opac中账号，如果修改过密码，请用修改后的密码进行登录;请使用自己的手机登录，登录更换手机将无法登录。'},
            {student: '学生：违约会有哪些影响？',
                teacher: '老师：由于读者未规范使用座位导致资源浪费等情况，读者可在预约界面看到，对于达到上限(3次)的读者将采取相应的措施，在7天内不允许预约，禁止预约期过后可恢复读者的预约权限，请大家注意规范使用座位。'},
            {student: '学生：违约会有哪些影响？',
                teacher: '老师：由于读者未规范使用座位导致资源浪费等情况，读者可在预约界面看到，对于达到上限(3次)的读者将采取相应的措施，在7天内不允许预约，禁止预约期过后可恢复读者的预约权限，请大家注意规范使用座位。'},
            {student: '学生：违约会有哪些影响？',
                teacher: '老师：由于读者未规范使用座位导致资源浪费等情况，读者可在预约界面看到，对于达到上限(3次)的读者将采取相应的措施，在7天内不允许预约，禁止预约期过后可恢复读者的预约权限，请大家注意规范使用座位。'},
        ]
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad(options) {

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady() {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow() {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide() {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload() {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh() {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom() {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage() {

    }
})